app/views/doctors/index.html.erb

SELECT COUNT(*) FROM "patients" WHERE "patients"."doctor_id" = ?  [["doctor_id", 9]]
---
        <td><%= current_doctor.email %></td>
        <td><%= current_doctor.patient.size %></td>