app/views/doctors/show.html.erb

SELECT "patients".* FROM "patients" WHERE "patients"."doctor_id" = ?  [["doctor_id", 1]]
---
  <tbody>
    <% current_doctor.patient.each do |p| %>