app/controllers/acutes_controller.rb

INSERT INTO "acutes" ("date_created", "answer", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date_created", 2016-12-12 23:34:00 UTC], ["answer", "7"], ["patient_id", 2], ["created_at", 2016-12-12 23:34:43 UTC], ["updated_at", 2016-12-12 23:34:43 UTC]]
---
  def create
    @acute = Acute.new(acute_params)
    @acute.patient_id = current_patient.id

    respond_to do |format|
      if @acute.save

DELETE FROM "acutes" WHERE "acutes"."id" = ?  [["id", 2]]
---
  def destroy
    @acute.destroy

SELECT  "acutes".* FROM "acutes" WHERE "acutes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_acute
      @acute = Acute.find(params[:id])