app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT "patients".* FROM "patients"